NextFOAM-24/tutorials/multiphase/compressibleMultiphaseInterFoam/laminar/damBreak4phase/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           $internalField;
    }

    rightWall
    {
        type            fixedValue;
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 293;
    }

    atmosphere
    {
        type            inletOutlet;
        phi             rhoPhi;
        inletValue      $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
